import React from 'react'
import { NavBar, Icon } from 'antd-mobile';

class Component extends React.Component {
    render() {
        return (
            <div id="HO-must">
                <header className='HO-header'>
                    <NavBar
                        mode="dark"
                        icon={<Icon type="left" />}
                        onLeftClick={() => this.props.history.go(-1)}


                    >用户须知</NavBar>
                </header>
                <div style={{ marginTop: '46px' }}></div>

                <div className="must"><p className="one">为充分保障您对美中嘉和医院（以下简称“掌医”）提供的各项服务和知情权、美中嘉和医院就提供的各项服务的相关性、有效性以及限制性提供如下注册条款说明。美中嘉和医院再此特别提醒您，您在注册使用本平台前，请务必仔细阅读本用户注册协议（以下简称“本协议”）。美中嘉和医院有权在必要时单方修改或变更本协议内容，并将通过“掌医”公布最新的服务协议，不单独进行个别通知。若您于任何修改或变更本协议后继续使用本服务，则视为您已阅读、了解并接受修改或变更，若您不同意，则您应立即主动停用本服务。 为维护双方利益、根据相关法律、法规的规定，双方在平等、自愿、公平、诚实、信用的基础上，美中嘉和医院与客户就业务服务的相关事宜达成以下协议：</p> <p className="two">第一条 使用须知</p> <p className="one">1.1 手机挂号：手机挂号规则以最新《手机挂号须知》为准。</p> <p className="one">1.2 已有我院就诊账号的就诊者，请在APP上注册账号并添加就诊人，绑定医院就诊账号，登录后选择就诊时间和就诊医生进行手机挂号，为保证个人健康档案内容的完整性，请不要重复注册和建档。</p> <p className="two">第二条 注册登录</p> <p className="one">2.1 您在注册时，需设置健康通行证（手机号）、密码，并需填写个人真实信息，包括姓名、身份证号、手机号码，绑定有效医院账号。</p> <p className="one">2.2 您在进行注册程序过程中，根据声音、文字或图形提示可以选择表示“同意”的操作，当您点选“同意”按钮时即视为您已仔细阅读本协议，同意接受本协议项下的所有条款，包括接受掌医对本协议条款随时所做的任何修改，并愿意受其拘束。</p> <p className="two">第三条 客户资料</p> <p className="one">3.1 您在注册登记时，需向美中嘉和医院提供真实、有效的客户资料。</p> <p className="one">3.2 美中嘉和医院以及开发公司对您的资料依法保密，但为建立与客户沟通渠道，改善服务工作，美中嘉和医院的客户资料。</p> <p className="one">3.2 美中嘉和医院以及开发公司对您的资料依法保密，但为建立与客户沟通渠道，改善服务工作，美中嘉和医院的客户资料。</p> <p className="two">第四条 客户的义务和承诺</p> <p className="one">4.1 您在进行注册过程中，您的用户名注册与使用应符合网络道德，遵守中华人民共和国的相关法律法规。您的用户名和昵称中不能含有威胁、淫秽、谩骂、非法、侵害他人正当合法权益等有争议性的文字。您在掌医上的言论不得违法、不得违反公序良俗、不得使用攻击性语言恶意中伤他人，或作出虚假性陈述。您保证您在掌医上提供的信息的真实性、合法性和有效性。您单独承担在掌医上发布内容的一切相关责任。您使用或提供的服务应遵守所有适用于掌医的地方法律、国家法律和国际法律标准。</p> <p className="one">4.2 您应遵守从中国境内向外传输技术性资料时必须符合中国有关法律法规。</p> <p className="one">4.3 您不得干扰或扰乱本服务。不得盗用他人帐号，并对由此行为造成的后果自负</p> <p className="one">4.4 若您的行为不符合本协议的规定，掌医有权做出独立判断，并立即停止向该您帐号提供服务。您需对自己在网上的行为承担法律责任。您若在掌医上散布和传播反动、色情或其他违反国家法律的信息，掌医的系统记录有可能作为您违反法律的证</p> <p className="two">第五条 业务的使用</p> <p className="one">5.1 自行承担手机上网所需的相关费用，如手机流量等</p> <p className="one">5.2 您应保证：提供详尽、真实、准确和完整的个人资料。如果资料发生变动，您应及时更改。若您提供任何错误、不实、过失或不完整的资料，并为美中嘉和医院所确知；或者美中嘉和医院有合理理由怀疑前述资料为错误、不实、过时或不完整的资料，美中嘉和医院有权暂停或者终止您的账号，并拒绝现在或将来使用本服务的全部或一部分，在此情况下，您可通过开发公司的申请途径与我们取得联系并修正个人资料，经开发公司核实后恢复账号使用。</p> <p className="two">第六条 法律声明</p> <p className="one">6.1 本系统涉及报告及费用信息仅作参考，请以医院实际纸质单据为准。</p></div>

            </div>
        )
    }
}

export default Component